Revit 2027 API
CoordinationModelLinkUtils.ReloadAutodeskDocsCoordinationModelFrom Method
 Reloads a Autodesk Docs Coordination Model type from the specified Autodesk Docs data.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ReloadAutodeskDocsCoordinationModelFrom(
	Document document,
	ElementType coordinationModelType,
	string accountId,
	string projectId,
	string fileId,
	string viewName
)
Public Shared Sub ReloadAutodeskDocsCoordinationModelFrom (
	document As Document,
	coordinationModelType As ElementType,
	accountId As String,
	projectId As String,
	fileId As String,
	viewName As String
)
public:
static void ReloadAutodeskDocsCoordinationModelFrom(
	Document^ document,
	ElementType^ coordinationModelType,
	String^ accountId,
	String^ projectId,
	String^ fileId,
	String^ viewName
)
static member ReloadAutodeskDocsCoordinationModelFrom :
        document : Document *
        coordinationModelType : ElementType *
        accountId : string *
        projectId : string *
        fileId : string *
        viewName : string -> unit
Parameters
document Document
 The document.
coordinationModelType ElementType
 The Coordination Model type element to reload.
accountId String
 The id of the Autodesk Docs account.
projectId String
 The id of the Autodesk Docs project.
fileId String
 The id of the Autodesk Docs file. A valid file id should start with "urn:WIPENVIRONMENT:dm.lineage:", followed by an unique identifier. The WIPENVIRONMENT varies from Region to Region. For example, for an account created in US Region, WIPENVIRONMENT = adsk.wipprod and a valid file id would be urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ.
viewName String
 View name.
Exceptions
Exception | Condition
ArgumentException |  Failed to validate file id. -or- document is not a project document. -or- The provided element is not a Autodesk Docs Coordination Model type. -or- This operation is not supported for scenario-based coordination models. Scenario-based coordination models are read-only and their source is managed by the scenario system.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to validate web services environment. -or- Failed to validate authentication. -or- The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- Failed to reload Coordination Model type from specified Autodesk Docs data.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 Authentication in Revit is a prerequisite for reloading Coordination Models from Autodesk Docs.
 The Autodesk Docs data projectId, fileId and viewName can be retrieved from the web URL of the 3D view. The Autodesk Docs account id can be retrieved from the Autodesk Docs Account settings. This data can also be retrieved via the Data Management API or Autodesk Construction Cloud API.
 This operation is blocked for Coordination Models that originate from a scenario. Scenario-based coordination models are read-only and cannot have their source changed.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace